programming/java/code/practical/practical.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practical Java Programming</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Practical Java Programming</h1>
<ul class="org-ul">
<li>Chapter 1 Introduction to Java</li>
<li>Chapter 2 Getting Started with Java Programming</li>
<li>Chapter 3 Basic Java Programming</li>
<li>Chapter 4 Java Programming for Windows Applications</li>
<li>Chapter 5 Java Programming for Networking Applications</li>
<li>Chapter 6 Java Programming for Mobile Applications</li>
<li>Chapter 7 Java Programming for IoT Applications</li>
<li>Chapter 8 Java Programming for AI Applications</li>
<li>Chapter 9 Java Programming for Cybersecurity Applications</li>
<li>Chapter 10 Java Programming for Blockchain Applications</li>
<li>Chapter 11 Java Programming for Big Data Applications</li>
<li>Appendix A Java Documentation and Archiving Tools and Online Resources</li>
<li>Appendix B Apache Maven Tutorial</li>
<li>Appendix C Git and GitHub Tutorial</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
